In [0]:
import numpy as np
import pandas as pd

# Data Selection

In order to explore a dataset and perform data analysis, we need to be able to select specific parts of our data. Selecting data allows us to clean/transform data to prepare for analysis, and create the appropriate calculations to get the results we need.

Now that the file is available, we can open it with the Pandas `read_csv` function

In [0]:
# Load titanic CSV data
csv_path = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv'
titanic = pd.read_csv(csv_path)
titanic

     PassengerId  Survived  Pclass  ...      Fare    Cabin  Embarked
0              1         0       3  ...    7.2500      NaN         S
1              2         1       1  ...   71.2833      C85         C
2              3         1       3  ...    7.9250      NaN         S
3              4         1       1  ...   53.1000     C123         S
4              5         0       3  ...    8.0500      NaN         S
..           ...       ...     ...  ...       ...      ...       ...
495          496         0       3  ...   14.4583      NaN         C
496          497         1       1  ...   78.2667      D20         C
497          498         0       3  ...   15.1000      NaN         S
498          499         0       1  ...  151.5500  C22 C26         S
499          500         0       3  ...    7.7958      NaN         S

[500 rows x 12 columns]

# Selecting Columns

![Selecting Columns](https://drive.google.com/uc?id=17_YMZ8CxJOPUyBIV1pHThMwIo-AwY9qB)

What if we want to analyze the passengers **age**?

In [0]:
# Select the age column Series
ages = titanic['Age']
ages

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
495     NaN
496    54.0
497     NaN
498    25.0
499    24.0
Name: Age, Length: 500, dtype: float64

As we expect, this created a Pandas Series

In [0]:
type(ages)

pandas.core.series.Series

The shape of our output verifies that we have a single dimension

In [0]:
ages.shape

(500,)

If we want to analyze both **Age** and **Sex** of the passengers, we can select multiple columns, creating a new dataframe.

In [0]:
# Selecting multiple columns creates a new dataframe
age_sex = titanic[["Age", "Sex"]]
age_sex.head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

Notice the double brackets: `titanic[["Age", "Sex"]]`

This time we pass a list of column names as a parameter, rather than a single column name.

In [0]:
# Verify that we have a new dataframe
type(age_sex)

pandas.core.frame.DataFrame

Because we have a dataframe, `shape` now outputs two dimensions.

In [0]:
age_sex.shape

(500, 2)

# Selecting Rows

![Selecting Rows](https://drive.google.com/uc?id=1NOsEk5vaDLkvCFLYDUHmci8ojat3Hmpl)

### Conditional Expressions


What if we only want to analyze passengers who are above a certain age?

In [0]:
above_35 = titanic[titanic["Age"] > 35]
above_35.head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1             2         1       1  ...  71.2833   C85         C
6             7         0       1  ...  51.8625   E46         S
11           12         1       1  ...  26.5500  C103         S
13           14         0       3  ...  31.2750   NaN         S
15           16         1       2  ...  16.0000   NaN         S

[5 rows x 12 columns]

Let's deconstruct what we just did, because there are a couple of important parts.

First, inspect the conditional expression where we select the age of the passengers: `titanic["Age"] > 35`

Evaluating this expression by itself, we see that it returns a Series of boolean values.

In [0]:
titanic["Age"] > 35

0      False
1       True
2      False
3      False
4      False
       ...
495    False
496     True
497    False
498    False
499    False
Name: Age, Length: 500, dtype: bool

A conditional expression can be used to select rows from a dataframe, because when we pass a boolean Series to a dataframe, Pandas will only select rows where the value is `True`.

Let's double check that it worked by comparing the shape of the original to the shape of the new dataframe. We should see fewer rows in the new dataframe.

In [0]:
# Original titanic dataframe shape
titanic.shape

(500, 12)

In [0]:
# New above_35 dataframe shape has fewer rows
above_35.shape

(115, 12)

### Multiple Conditions

What if we want to select only rows where the passenger class is 2 or 3?

In [0]:
class_23 = titanic[(titanic["Pclass"] == 2) | (titanic["Pclass"] == 3)]
class_23.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
2            3         1       3  ...   7.9250   NaN         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
7            8         0       3  ...  21.0750   NaN         S

[5 rows x 12 columns]

This time we have two conditional expressions, combined with the or `|` operator. Thus, we select rows where the passenger class is either 2 or 3.


-------------------------
NOTE:

Because we are combining booleans, we need to remember to use the boolean `&`, `|` operators, rather than python's `and`, `or`.

-------------------------


We can deconstruct these expressions as well in order to get a feel for what is going on.

In [0]:
# Rows where passenger class is 2
(titanic["Pclass"] == 2)

0      False
1      False
2      False
3      False
4      False
       ...
495    False
496    False
497    False
498    False
499    False
Name: Pclass, Length: 500, dtype: bool

In [0]:
# Rows where passenger class is 3
(titanic["Pclass"] == 3)

0       True
1      False
2       True
3      False
4       True
       ...
495     True
496    False
497     True
498    False
499     True
Name: Pclass, Length: 500, dtype: bool

In [0]:
# Rows where passenger class is 2 or 3
(titanic["Pclass"] == 2) | (titanic["Pclass"] == 3)

0       True
1      False
2       True
3      False
4       True
       ...
495     True
496    False
497     True
498    False
499     True
Name: Pclass, Length: 500, dtype: bool

We can also use Pandas `isin` function to perform the same task:

In [0]:
# Use `isin()` to select multiple passenger classes
class_23 = titanic[titanic["Pclass"].isin([2, 3])]
class_23.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
2            3         1       3  ...   7.9250   NaN         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
7            8         0       3  ...  21.0750   NaN         S

[5 rows x 12 columns]

Evaluating the inner statement by itself, we see that the `isin` function returns a boolean Series, just like our previous conditional statements!

In [0]:
# `isin()` returns a boolean Series
titanic["Pclass"].isin([2, 3])

0       True
1      False
2       True
3      False
4       True
       ...
495     True
496    False
497     True
498    False
499     True
Name: Pclass, Length: 500, dtype: bool

# Conditions on Multiple Columns

What if we want to compare the number of female passnegers who survived to the number of male passengers who survived?

We can do this by splitting our data into two dataframes. First let's select the female passengers who survived.

In [0]:
# Select female passengers who survived
female_survived = titanic[(titanic['Survived']==1) & (titanic['Sex'] == 'female')]
female_survived.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [0]:
# See how many females survived
female_survived.shape

(139, 12)

In [0]:
# Select male passengers who survived
male_survived = titanic[(titanic['Survived']==1) & (titanic['Sex'] == 'male')]
male_survived.head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
17           18         1       2  ...  13.0000   NaN         S
21           22         1       2  ...  13.0000   D56         S
23           24         1       1  ...  35.5000    A6         S
36           37         1       3  ...   7.2292   NaN         C
55           56         1       1  ...  35.5000   C52         S

[5 rows x 12 columns]

In [0]:
# See how many males survived
male_survived.shape

(54, 12)

Compared to males, well over twice as many females survived!

In [0]:
print('Females vs males:')
len(female_survived) / len(male_survived)

Females vs males:

2.574074074074074

# Selecting Known Data

It is often the case that a dataset will contain blank or NA values. Inspecting the age column, we see that some ages were unknown:

In [0]:
titanic['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
495     NaN
496    54.0
497     NaN
498    25.0
499    24.0
Name: Age, Length: 500, dtype: float64

(Notice the `NaN` values above)

We can select only known values using Pandas' `notna` conditional function, which returns a `True` for each row where the values are not a `Null` value.

In [0]:
age_no_na = titanic[titanic["Age"].notna()]
age_no_na.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

By comparing shapes, it looks like we removed over 100 rows that contained `NaN`.

In [0]:
# Original dataframe shape
titanic.shape

(500, 12)

In [0]:
# New dataframe shape
age_no_na.shape

(398, 12)

# Selecting Rows and Columns

![Selecting Rows and Columns](https://drive.google.com/uc?id=1iWzdqmL2IUYwHS3ZXdKDRqiq2ait31qk)

Pandas has two functions `iloc` and `loc` that enable selection of rows and columns at the same time.

- `iloc` selects rows and columns based on indexes (numbers)
- `loc` selects rows and columns based on labels (text)

Both locators select using the format `[rows, columns]`.

# Select with `iloc`

When we know the **indexes** of the data we're interested, we can use `iloc`.

In [0]:
# Remember what our titanic dataframe looks like
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

What if we want to inspect only the first 3 rows and the first 4 columns?

In [0]:
# Select with iloc using the format [row_range, column_range]
subset1 = titanic.iloc[0:3, 0:4]
subset1

   PassengerId  ...                                               Name
0            1  ...                            Braund, Mr. Owen Harris
1            2  ...  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3  ...                             Heikkinen, Miss. Laina

[3 rows x 4 columns]

Select the last 4 rows and the last 2 columns:

In [0]:
# Select with iloc using the format [row_range, column_range]
subset2 = titanic.iloc[-4:, -2:]
subset2

       Cabin Embarked
496      D20        C
497      NaN        S
498  C22 C26        S
499      NaN        S

Select rows and columns in the middle of the dataframe:

In [0]:
# Select with iloc using the format [row_range, column_range]
subset2 = titanic.iloc[33:41, 5:7]
subset2

     Age  SibSp
33  66.0      0
34  28.0      1
35  42.0      1
36   NaN      0
37  21.0      0
38  18.0      2
39  14.0      1
40  40.0      1

Select specific rows and columns by passing a list of numbers to `iloc`.

In [0]:
# Select with iloc using the format [rows_list, columns_list]
titanic.iloc[[1,3,8,12], [1,4,6]]

    Survived     Sex  SibSp
1          1  female      1
3          1  female      1
8          1  female      0
12         0    male      0

# Select with `loc`

When we know the **labels** of the data we're interested, we can use `loc`.

In [0]:
# Create a sample Dataframe with row labels
df = pd.DataFrame({'date': pd.date_range('2020-01-01', periods=5),
                   'numbers': [np.nan,1,8,5,1],
                   'fractions': [0.481236,0.758691, 0.977380, 0.992931,	np.nan],
                   'category': pd.Categorical(["test", "train", "test", "train", "test"]),
                   'boolean': pd.array([True, False, False, False, True], dtype='boolean')},
                  index=['a','b','c','d', 'e'])
df

        date  numbers  fractions category  boolean
a 2020-01-01      NaN   0.481236     test     True
b 2020-01-02      1.0   0.758691    train    False
c 2020-01-03      8.0   0.977380     test    False
d 2020-01-04      5.0   0.992931    train    False
e 2020-01-05      1.0        NaN     test     True

Selecting a single row and a single column returns the **value** at that location.

In [0]:
df.loc['a','category']

'test'

In [0]:
df.loc['d','numbers']

5.0

Selecting a range of rows and a single column returns a `Series`.

In [0]:
df.loc['c':'e', 'fractions']

c    0.977380
d    0.992931
e         NaN
Name: fractions, dtype: float64

Selecting a single row and a range of columns also returns a `Series`.

In [0]:
df.loc['b', 'fractions':'boolean']

fractions    0.758691
category        train
boolean         False
Name: b, dtype: object

Selecting a range of rows and columns returns a `Dataframe`.

In [0]:
df.loc['a':'c', 'numbers':'category']

   numbers  fractions category
a      NaN   0.481236     test
b      1.0   0.758691    train
c      8.0   0.977380     test

We can also select spcific rows and columns by passing lists of labels to `loc`.

In [0]:
df.loc[['b', 'e'], ['date', 'numbers', 'boolean']]

        date  numbers  boolean
b 2020-01-02      1.0    False
e 2020-01-05      1.0     True

# Chaining Locators

Locators can be chained together in a single expression.

In [0]:
# Remember what our titanic dataframe looks like
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Find a list of row indexes with `iloc`, then select all rows for the given range of column labels with `loc`.

In [0]:
titanic.iloc[[1,3,5]].loc[:, 'Name':'Age']

                                                Name     Sex   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                   Moran, Mr. James    male   NaN

# Conditional Locators

We can use conditional statements with both `iloc` and `loc` just as we did previously with dataframe selectors.

We'll use `loc` as an example because it is a bit more common to conditionally select rows, then choose columns based on labels.

In [0]:
# Remember what our titanic dataframe looks like
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

What if we want to analyze the **age** and **fare** of passengers in **Pclass 1**?

In [0]:
titanic.loc[titanic['Pclass']==1, ['Age', 'Fare']]

      Age      Fare
1    38.0   71.2833
3    35.0   53.1000
6    54.0   51.8625
11   58.0   26.5500
23   28.0   35.5000
..    ...       ...
487  58.0   29.7000
492  55.0   30.5000
493  71.0   49.5042
496  54.0   78.2667
498  25.0  151.5500

[116 rows x 2 columns]

Now select the cabin of male passengers who survived.

In [0]:
titanic.loc[((titanic['Survived']==1) & (titanic['Sex'] == 'male')), 'Cabin']

17         NaN
21         D56
23          A6
36         NaN
55         C52
65         NaN
74         NaN
78         NaN
81         NaN
97     D10 D12
107        NaN
125        NaN
127        NaN
146        NaN
165        NaN
183         F4
187        NaN
193         F2
204        NaN
207        NaN
209        A31
220        NaN
224        C93
226        NaN
248        D35
261        NaN
267        NaN
271        NaN
283        NaN
286        NaN
288        NaN
298       C106
301        NaN
305    C22 C26
338        NaN
340         F2
348        NaN
370        E50
390    B96 B98
391        NaN
400        NaN
407        NaN
414        NaN
429        E10
430        C52
444        NaN
445        A34
447        NaN
449       C104
453        C92
455        NaN
460        E12
484        B49
489        NaN
Name: Cabin, dtype: object

There are a lot of people who don't have cabins. We can filter them out by including the `notna` funciton in our conditional statements.

In [0]:
titanic.loc[((titanic['Survived']==1) & (titanic['Sex'] == 'male') & titanic['Cabin'].notna()), 'Cabin']

21         D56
23          A6
55         C52
97     D10 D12
183         F4
193         F2
209        A31
224        C93
248        D35
298       C106
305    C22 C26
340         F2
370        E50
390    B96 B98
429        E10
430        C52
445        A34
449       C104
453        C92
460        E12
484        B49
Name: Cabin, dtype: object

# Summary

- When selecting subsets of data, square brackets `[]` are used.
- Inside these brackets, you can use a single column/row label, a list of column/row labels, a slice of labels, a conditional expression or a colon.
- Select specific rows and/or columns using `iloc` when using the positions in the table
- Select specific rows and/or columns using `loc` when using the row and column names